#### BuiltInFailures.LooseDimensionFailures Members

---

|  |
| --- |
| BuiltInFailures LooseDimensionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures LooseDimensionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | LooseCurtainWallData | Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost. |
| Public property Static member | LooseDimensionsForCurtainWall | Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted. |
| Public property Static member | LooseFaceSplitsForCurtainWall | Switching element type to Curtain Family. All Split Face Regions in the element will be deleted. |
| Public property Static member | LooseInsertsForCurtainWall | Switching element type to Curtain element. All inserts in the element will be deleted. |
| Public property Static member | LooseWallsweepsForCurtainWall | Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted. |

# See Also

BuiltInFailures LooseDimensionFailures Class

Autodesk.Revit.DB Namespace